#### SelectionFilterAction Enumeration

---

|  |
| --- |
| See Also |

An enumerated type containing the type of actions that may be taken with a selection filter applied to a point cloud.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public enum SelectionFilterAction ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration SelectionFilterAction ``` |

| Visual C++ |
| --- |
| ``` public enum class SelectionFilterAction ``` |

# Members

| Member name | Description |
| --- | --- |
| None | Selection filter is ignored. |
| Highlight | Points that pass the filter are highlighted. |
| Isolate | Only points that pass the filter are visible. |

# See Also

Autodesk.Revit.DB Namespace